Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.authentik_system.data.kubernetes_service_v1.authentik_server: Reading...
module.authentik_system.data.kubernetes_service_v1.authentik_server: Read complete after 0s [id=authentik/authentik-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.atlantis.helm_release.atlantis will be updated in-place
~ resource "helm_release" "atlantis" {
      ~ id                         = "runatlantis" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.35.0" -> (known after apply)
          ~ chart          = "atlantis" -> (known after apply)
          ~ first_deployed = 1753233833 -> (known after apply)
          ~ last_deployed  = 1753235858 -> (known after apply)
          ~ name           = "runatlantis" -> (known after apply)
          ~ namespace      = "atlantis-system" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                  - github
                  - githubApp
                  - gitea
                  - gitlab
                  - bitbucket
            EOT -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - atlantisUrl        = "https://atlantis.billv.ca"
                  - aws                = {
                      - credentials = "(sensitive value)"
                    }
                  - environment        = {
                      - ATLANTIS_GH_ORG            = "billv-ca"
                      - ATLANTIS_GH_TEAM_ALLOWLIST = "admins:plan, admins:apply, admins:state, admins:import, admins:unlock, admins:approve_policies"
                    }
                  - environmentSecrets = [
                      - {
                          - name         = "TF_VAR_authentik_api_key"
                          - secretKeyRef = {
                              - key  = "authentik_api_key"
                              - name = "authentik-api-key"
                            }
                        },
                      - {
                          - name         = "TF_VAR_proxmox_password"
                          - secretKeyRef = {
                              - key  = "proxmox_password"
                              - name = "proxmox-password"
                            }
                        },
                    ]
                  - extraArgs          = [
                      - "--automerge",
                    ]
                  - githubApp          = {
                      - id     = "1224527"
                      - key    = "(sensitive value)"
                      - secret = "(sensitive value)"
                    }
                  - orgAllowlist       = "github.com/billv-ca/homelab-atlantis*"
                  - volumeClaim        = {
                      - storageClassName = "longhorn"
                    }
                }
            ) -> (known after apply)
          ~ version        = "5.18.0" -> (known after apply)
        } -> (known after apply)
        name                       = "runatlantis"
      ~ version                    = "5.18.0" -> "5.18.1"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```